#### This iis the project 1

In [19]:
import pandas as pd
import numpy as np
data = {'name' : ["Prashant","shrey","vikas","Adhyan","Sumit","Mudit","Vipasha"],
        'com' : ["Nag","TCS","BLS","TCS","TCS","TCS",np.nan],
        'sal' : [8,6,6,4,5,7,4]}

df = pd.DataFrame(data)
print(df)

       name  com  sal
0  Prashant  Nag    8
1     shrey  TCS    6
2     vikas  BLS    6
3    Adhyan  TCS    4
4     Sumit  TCS    5
5     Mudit  TCS    7
6   Vipasha  NaN    4

#### Get First and Last rows

In [20]:
print("By default istop 5 rows\n",df.head())
print("\ntop 2rows \n",df.head(2))
print("\nBy default is last 5 rows\n",df.tail())
print("\nlast 2 rows\n",df.tail(2))

By default istop 5 rows
        name  com  sal
0  Prashant  Nag    8
1     shrey  TCS    6
2     vikas  BLS    6
3    Adhyan  TCS    4
4     Sumit  TCS    5

top 2rows
        name  com  sal
0  Prashant  Nag    8
1     shrey  TCS    6

By default is last 5 rows
       name  com  sal
2    vikas  BLS    6
3   Adhyan  TCS    4
4    Sumit  TCS    5
5    Mudit  TCS    7
6  Vipasha  NaN    4

last 2 rows
       name  com  sal
5    Mudit  TCS    7
6  Vipasha  NaN    4

#### Find the shape and rows,columns

In [22]:
print(df.shape)
print("No of rows: " ,df.shape[0])
print("No of Columns: ", df.shape[1])

(7, 3)
No of rows:  7
No of Columns:  3

#### Get the info about the dataframe

In [23]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   com     6 non-null      object
 2   sal     7 non-null      int64
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes
None

#### Check  Null Value is the dataset

In [24]:
print(df.isnull())
print("Null Values count\n",df.isnull().sum())
print("Row by null valuess\n:",df.isnull().sum(axis = 1))

    name    com    sal
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False   True  False
Null Values count
 name    0
com     1
sal     0
dtype: int64
Row by null valuess
: 0    0
1    0
2    0
3    0
4    0
5    0
6    1
dtype: int64

#### Get overall Statisics of dataframe

In [26]:
print(df.describe())   # this print  the info only for the intigers columns
print(df.describe(include = 'all'))  # this print the info about other datatypes as well

            sal
count  7.000000
mean   5.714286
std    1.496026
min    4.000000
25%    4.500000
50%    6.000000
75%    6.500000
max    8.000000
            name  com       sal
count          7    6  7.000000
unique         7    3       NaN
top     Prashant  TCS       NaN
freq           1    4       NaN
mean         NaN  NaN  5.714286
std          NaN  NaN  1.496026
min          NaN  NaN  4.000000
25%          NaN  NaN  4.500000
50%          NaN  NaN  6.000000
75%          NaN  NaN  6.500000
max          NaN  NaN  8.000000

#### Find unique column from the com column

In [31]:
print(df['com'].unique())
print(df['com'].nunique())  #  nunique is used to count the  unique values ffrom any  column
print(df['com'].value_counts())  #Value count  is used to count the value from the each unique category

['Nag' 'TCS' 'BLS' nan]
3
com
TCS    4
Nag    1
BLS    1
Name: count, dtype: int64

#### find the sal between 6 to 8  (both included)

In [47]:
print("Here is the no of  people who havee this criteria: ")
print(len(df[(df['sal']>=6) &  (df['sal']<=8)])) #Note that if we are passing ore then one condition always use () for passing the condition ex: (df['sal']<=8)

print("Using the Between mwthod: ")
print(sum(df['sal'].between(6,8)))  #

Here is the no of  people who havee this criteria:
4
Using the Between mwthod:
4

#### find the average sal:

In [53]:
print("Average value:",df['sal'].mean())
print("Total sal",df['sal'].sum())
print("Min sal:",df['sal'].min())
print("Max Sal:",df['sal'].max())
print("Standered diviation of sal",df['sal'].std())

Average value: 5.714285714285714
Total sal 40
Min sal: 4
Max Sal: 8
Standered diviation of sal 1.4960264830861911

#### Create one new column and apply your own function:

In [58]:
# This function will divide  the saalry value by 12:
def div12(x):
    return x/12

df['sal/12'] = df['sal'].apply(div12)  # Apply method is used to apply our own function over the dataframe...
print(df)

#  df['sal'].apply(lambda x: x/12) Similar as above but used lambda function

       name  com  sal    sal/12
0  Prashant  Nag    8  0.666667
1     shrey  TCS    6  0.500000
2     vikas  BLS    6  0.500000
3    Adhyan  TCS    4  0.333333
4     Sumit  TCS    5  0.416667
5     Mudit  TCS    7  0.583333
6   Vipasha  NaN    4  0.333333

#### Map Function is Pandas : used for maaping record with specific value

In [85]:
df['com_maping'] = df['com'].map({'TCS': 1 , 'Nag' : 2, 'BLS' : 2})
print(df)

       name  com  sal    sal/12  com_maping
0  Prashant  Nag    8  0.666667         2.0
1     shrey  TCS    6  0.500000         1.0
2     vikas  BLS    6  0.500000         2.0
3    Adhyan  TCS    4  0.333333         1.0
4     Sumit  TCS    5  0.416667         1.0
5     Mudit  TCS    7  0.583333         1.0
6   Vipasha  NaN    4  0.333333         NaN

#### Drop Columns in Pandas

In [86]:
df.drop('com_maping',axis  = 1) #for  droping single column
# df.drop(['com_maping','sal/12'],axis = 1) forr  drowping the multiple column

       name  com  sal    sal/12
0  Prashant  Nag    8  0.666667
1     shrey  TCS    6  0.500000
2     vikas  BLS    6  0.500000
3    Adhyan  TCS    4  0.333333
4     Sumit  TCS    5  0.416667
5     Mudit  TCS    7  0.583333
6   Vipasha  NaN    4  0.333333

#### Sorted the DataFrame by Sal

In [87]:
print(df.sort_values(by  = 'sal', ascending = False))

       name  com  sal    sal/12  com_maping
0  Prashant  Nag    8  0.666667         2.0
5     Mudit  TCS    7  0.583333         1.0
1     shrey  TCS    6  0.500000         1.0
2     vikas  BLS    6  0.500000         2.0
4     Sumit  TCS    5  0.416667         1.0
3    Adhyan  TCS    4  0.333333         1.0
6   Vipasha  NaN    4  0.333333         NaN

#### Display the Name and salary of TCS

In [93]:
df[df['com'] == 'TCS'][['name','sal']].sort_values(by  = 'name')

     name  sal
3  Adhyan    4
5   Mudit    7
4   Sumit    5
1   shrey    6